// Циклы while и for. Решите эти задачи сначала через цикл while, а затем через цикл for.

// 1: Выведите столбец чисел от 11 до 33.
let i = 11;
// while (i <= 33) {
// 	console.log(i);
// 	i++;
// };

// for (; i < 34; i++){
// 	console.log(i);
// }

// ==============================================================================
// 2: Выведите столбец четных чисел в промежутке от 0 до 100.
let j = 0;
// while (j <= 100) {
//   if (j % 2 === 0) {
//     console.log(j);
//   }
//   j++;
// }

// for (; j <= 100; j++){
// 	if (j % 2 === 0) {
// 		console.log(j);
// 	}
// }
// ==============================================================================

// 3: С помощью цикла найдите сумму чисел от 1 до 100.
let k = 1;
let sum = 0;
// while (k <= 100) {
// 	sum += k
// 	k++
// }

// for (; k <= 100; k++){
// 	sum += k;
// }
// console.log(sum);
// ==============================================================================

// 4: Даны числа от 1 до 10.
// Найти факториал каждого числа.
// Подсказка: формула факториала n!
// n! = 1 * … * (n-2) * (n-1) * n.
// Пример вывода: Факториал 5 = 120.
let n = 5;
let total = 1;

// while (n > 0) {
// 	console.log(`Факториал ${n} = ${total}`);

// 	total *= n;
// 	n--;
// }
// for (let i = 0; i < n; i++){
// 	console.log(`Факториал ${i+1} = ${total}`);
// 	total *= (n - i);
// }
// ==============================================================================

// 5. Дан массив с элементами 1, 2, 3, 4, 5, 6, 7, 8, 9. С помощью цикла for создайте строку '-1-2-3-4-5-6-7-8-9-'.
const arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];
let newArr = "-";
// for (let i = 0; i < arr.length; i++){
// 	newArr += arr[i] + '-'
// }
// console.log(newArr);
// ==============================================================================

// 6. Есть массив с пользователями:
const users = [
  { name: "Bakyt", age: 17, job: "Student" },
  { name: "Erjan", age: 21, job: "Student" },
  { name: "Gulzada", age: 18, job: "Student" },
  { name: "Aizada", age: 20, job: "Student" },
];
// Переберите массив и выведите в консоль имена тех пользователей, возраст которых превышает 18 лет
// for (let i = 0; i < users.length; i++){
// 	if (users[i].age > 18) {
// 		console.log(users[i].name);
// 	}
// }