/*1: Объявить переменные x, a, b, c.
Присвоить значение a = 2, b = 3, c = 21, x = "x".
Вывести следующий текст в консоль, но заменить все буквы переменными:
Решить уравнение:
ax^2 + bx + c = 0
a = 2, b = 3, c = 21*/

const x = "x";
const a = 2;
const b = 3;
const c = 21;

/* console.log("Решить уравнение:");
console.log(a + 'x^2 + ' + b + 'x + ' + c + ' = 0');
console.log("a = " + a + ", b = " + b + ", c = " + c); */

console.log(`Решить уравнение: \n${a}${x}^2 + ${b}${x} + ${c} = 0 \na = ${a}, b = ${b}, c = ${c}`);

// ============================================================================

/* 2: Вывести следующий текст через переменную:
"Все что может быть написано на Javascript, в конечном итоге будет написано на Javascript" - Джеф Этвуд */

const quote =
  '"Все что может быть написано на Javascript, в конечном итоге будет написано на Javascript"';
const author = "Джеф Этвуд";
// console.log(quote + " - " + author);
// console.log(`${quote} - ${author}`)
// ============================================================================

/* 3: Создайте переменные, в которые будут записаны Ваши данные, например: let name = 'Adilet'
	Выведите следующий образом:
		Имя: Адилет
		Фамилия: Акматов
		Возраст: 20
		Деятельность: node.js разработчик
		Хобби: волейбол */

const name = "Ислам";
const surname = "Майназаров";
let age = 27;
let practice = "node.js разработчик";
let hobby = "футбол";

/* console.log(`Имя: ${name}
Фамилия: ${surname}
Возраст: ${age}
Деятельность: ${practice}
Хобби: ${hobby}`); */

/*console.log(`Имя: ${name}`);
console.log(`Фамилия: ${surname}`);
console.log(`Возраст: ${age}`);
console.log(`Деятельность: ${practice}`);
console.log(`Хобби: ${hobby}`); */

